royal-mail-shipping-api/dan/soap-current-attempt-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.royalmailgroup.com/integration/core/V1" xmlns:ns2="http://www.royalmailgroup.com/api/ship/V2" xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><SOAP-ENV:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:UsernameToken wsu:Id="UsernameToken-435250259123E0B244145512248467018">
            <wsse:Username>0127229000</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">qd/vpR+ler2pyh9wjFkuogUqX2A=</wsse:Password>
            <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">MTg4NTkwNTE5NQ==</wsse:Nonce>
            <wsu:Created>2016-02-11T10:01:35</wsu:Created>
        </wsse:UsernameToken>
    </wsse:Security>
</SOAP-ENV:Header><SOAP-ENV:Body><ns2:createShipmentRequest><ns2:integrationHeader><ns1:dateTime>2016-02-11T10:01:35</ns1:dateTime><ns1:version>2</ns1:version><ns1:identification><ns1:applicationId>0127229000</ns1:applicationId><ns1:transactionId>1</ns1:transactionId></ns1:identification></ns2:integrationHeader><ns2:requestedShipment><ns2:shipmentType><code>Delivery</code></ns2:shipmentType><ns2:serviceType><code>1</code></ns2:serviceType><ns2:serviceOffering><serviceOfferingCode><code>CRL</code></serviceOfferingCode></ns2:serviceOffering><ns2:serviceFormat><serviceFormatCode/></ns2:serviceFormat><ns2:shippingDate>2016-02-11</ns2:shippingDate><ns2:recipientContact><ns2:name>Martin Wyatt</ns2:name></ns2:recipientContact><ns2:recipientAddress><addressLine1>Unit 2 The Sidings</addressLine1><postTown>Bacup</postTown><postcode>EC1A 1BB</postcode></ns2:recipientAddress><ns2:items><ns2:item><ns2:numberOfItems>1</ns2:numberOfItems><ns2:weight><unitOfMeasure><unitOfMeasureCode><code>g</code></unitOfMeasureCode></unitOfMeasure><value>50</value></ns2:weight></ns2:item></ns2:items></ns2:requestedShipment></ns2:createShipmentRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
